doc/org-mode/advanced.org
# vim: ts=2 sw=2 et ft=org
#+STYLE: <LINK href="stylesheet.css" rel="stylesheet" type="text/css" />
#+TITLE: Nitrogen 2.x Documentation
#+AUTHOR: Rusty Klophaus (@rustyio)
#+OPTIONS:   H:2 num:1 toc:1 \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+EMAIL: 

#+TEXT: [[http://nitrogenproject.com][Home]] | [[file:./index.org][Getting Started]] | [[file:./api.org][API]] | [[file:./elements.org][Elements]] | [[file:./actions.org][Actions]] | [[file:./validators.org][Validators]] | [[file:./handlers.org][Handlers]] | [[file:./config.org][Configuration Options]] | *Advanced Guides* | [[file:./troubleshooting.org][Troubleshooting]] | [[file:./about.org][About]]
#+HTML: <div class=headline>Advanced Nitrogen Guides and Tools</div>

* Advanced Guides and Tools

  + [[file:./advanced/jquery_mobile_integration.org][jQuery Mobile Integration]] :: Nitrogen's Mobile elements and how to use them.

  + [[file:./advanced/paths.org][Nitrogen Paths]] :: Understanding Nitrogen's
    element selectors for wiring, querying, CSS, and jQuery selectors.

  + [[file:./advanced/rest.org][Making a REST Handler]] :: With Nitrogen, you
    can build a simple REST handler module. Here is everything you need to know
    about it.

  + [[file:./advanced/smart_extensions.org][Smart Extensions]] :: Smart
    extensions allow you to create alternate entry points into page modules based
    on the extension of the request. This is useful for adding things like .json
    handlers, or .csv, or whatever.

  + [[file:./advanced/testing.org][Automated Testing]] :: Nitrogen has a
    built-in testing system for testing your application both on the client and
    server, as well as the interaction between the two.

  + [[file:./advanced/plugins.org][Plugin System]] :: Nitrogen is easily
    extendable with plugins. This is a guide for both adding plugins, and also
    creating your own.

  + [[http://sigma-star.com/blog/post/embedding-nitrogen][Embedding Nitrogen into an existing application]] (external) :: If you
    have an existing Erlang application, this guide will walk you through
    adding a web-based front-end to it using Nitrogen's =embed= script.

  + [[http://cstar.io/2014/07/02/nitrogen-on-heroku.html][Deploying Nitrogen on Heroku]] (external) :: A step-by-step
    guide to making your Nitrogen app Heroku-ready.
