doc/html/advanced.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nitrogen 2.x Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Nitrogen 2.x Documentation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2015-01-31 09:56:15 CST"/>
<meta name="author" content="Rusty Klophaus (@rustyio)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Nitrogen 2.x Documentation</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="./index.html">Getting Started</a> | <a href="./api.html">API</a> | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./config.html">Configuration Options</a> | <b>Advanced Guides</b> | <a href="./troubleshooting.html">Troubleshooting</a> | <a href="./about.html">About</a>
</p>


<div class=headline>Advanced Nitrogen Guides and Tools</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Advanced Guides and Tools</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Advanced Guides and Tools</h2>
<div class="outline-text-2" id="text-1">


<dl>
<dt><a href="./advanced/jquery_mobile_integration.html">jQuery Mobile Integration</a></dt><dd>Nitrogen's Mobile elements and how to use them.

</dd>
<dt><a href="./advanced/paths.html">Nitrogen Paths</a></dt><dd>Understanding Nitrogen's
    element selectors for wiring, querying, CSS, and jQuery selectors.

</dd>
<dt><a href="./advanced/rest.html">Making a REST Handler</a></dt><dd>With Nitrogen, you
    can build a simple REST handler module. Here is everything you need to know
    about it.

</dd>
<dt><a href="./advanced/smart_extensions.html">Smart Extensions</a></dt><dd>Smart
    extensions allow you to create alternate entry points into page modules based
    on the extension of the request. This is useful for adding things like .json
    handlers, or .csv, or whatever.

</dd>
<dt><a href="./advanced/testing.html">Automated Testing</a></dt><dd>Nitrogen has a
    built-in testing system for testing your application both on the client and
    server, as well as the interaction between the two.

</dd>
<dt><a href="./advanced/plugins.html">Plugin System</a></dt><dd>Nitrogen is easily
    extendable with plugins. This is a guide for both adding plugins, and also
    creating your own.

</dd>
<dt><a href="http://sigma-star.com/blog/post/embedding-nitrogen">Embedding Nitrogen into an existing application</a> (external)</dt><dd>If you
    have an existing Erlang application, this guide will walk you through
    adding a web-based front-end to it using Nitrogen's <code>embed</code> script.

</dd>
<dt><a href="http://cstar.io/2014/07/02/nitrogen-on-heroku.html">Deploying Nitrogen on Heroku</a> (external)</dt><dd>A step-by-step
    guide to making your Nitrogen app Heroku-ready.
</dd>
</dl>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2015-01-31 09:56:15 CST</p>
<p class="author">Author: Rusty Klophaus (@rustyio)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/advanced.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
